// Дана json строка (можно сохранить в файл и читать из файла) 
// (Коллеги, если сложно будет распарсить .json -> можно работать как со строкой обычной)
// [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},{"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},
// {"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
// Написать метод(ы), который распарсит json и, используя StringBuilder, создаст строки вида: 
// Студент [фамилия] получил [оценка] по предмету [предмет].
// Пример вывода:
// Студент Иванов получил 5 по предмету Математика.
// Студент Петрова получил 4 по предмету Информатика.
// Студент Краснов получил 5 по предмету Физика.

package Seminar2;


public class Parsingstring {
    public static void main(String[] args){
        String str_progress_bar = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"}," +
         "{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"}," +
         "{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";

         String[] arr_progress_bar = str_progress_bar.split("},");
         for (int i = 0; i < arr_progress_bar.length; i++) {
            System.out.println(arr_progress_bar[i]);
         }
         System.out.println(arr_progress_bar[1]); 
    }
}
